export const projectData = {
    raum: {
        title: "weeklytodo",
        description: "외주로 진행한 워드프레스 기반 홈페이지 제작 프로젝트로, 고객이 제공한 사진과 텍스트 콘텐츠를 바탕으로\n각 섹션의 배치와 시각적 흐름을 고려하여 디자인 및 구조 작업을 진행했습니다.\n전체적인 레이아웃과 사용자 동선을 설계하면서 웹사이트의 시각적 완성도를 높이는 데 중점을 두었고,\n다양한 플러그인을 활용해 필요한 기능을 구현함으로써 고객의 요구사항을 충실히 반영할 수 있었습니다.\n프로젝트 과정에서 고객과의 소통을 통해 요구사항을 정리하고 수시로 피드백을 반영하는 등\n실질적인 CS(고객 응대) 경험도 쌓을 수 있었습니다. 비록 직접적인 코드 구현은 없었지만,\n워드프레스의 테마 구조와 페이지 구성 방식, 기본적인 PHP 동작 원리에 대한 이해를 깊게 다질 수 있었고,\nCMS 기반 웹사이트 제작의 실무 흐름을 폭넓게 경험할 수 있었습니다.",
        date: "2024.04 ~ 2024.05",
        function: "부드러운 스크롤, 웹사이트 구조 구성, 페이지 이동, 애니메이션",
        skill: "Wordpress, Javascript, HTML, CSS, PHP",
        contribution: "100%",
        git: "https://24raumamc.co.kr/"
    },
    yunli: {
        title: "yunli",
        description: "외주로 진행한 Cafe24 기반 쇼핑몰 커스터마이징 프로젝트로, 고객이 원하는 디자인 방향성과 쇼핑몰 운영 목적에 맞춰 기획하고 반영하는 작업을 수행했습니다.\nCafe24의 스마트디자인 환경을 분석하며 구조를 파악하고, 요구사항에 따라 기능을 조정하면서 쇼핑몰의 사용성과 시각적 완성도를 높이는 데 집중했습니다.\n프로젝트 과정에서 고객과의 피드백을 주고받으며 실제 서비스를 위한 커뮤니케이션과 고객 응대 경험을 쌓았고,\n이를 통해 쇼핑몰 제작 전반의 흐름과 플랫폼 기반 커스터마이징 실무를 경험해볼 수 있었습니다.",
        date: "2024.03 ~ 2024.04",
        function: "메인 레이아웃, 메뉴 구성, 상품 리스트 hover 시 착용 이미지 전환, 컬렉션 사진 가로 스크롤",
        skill: "Cafe24, Javascript, HTML, CSS, JQuery",
        contribution: "40%",
        url: "https://yunli.world/"
    },
    muaga: {
        title: "muaga",
        description: "외주로 진행한 워드프레스 기반 홈페이지 제작 프로젝트로, 고객이 제공한 사진과 텍스트 콘텐츠를 바탕으로\n각 섹션의 배치와 시각적 흐름을 고려하여 디자인 및 구조 작업을 진행했습니다.\n전체적인 레이아웃과 사용자 동선을 설계하면서 웹사이트의 시각적 완성도를 높이는 데 중점을 두었고,\n다양한 플러그인을 활용해 필요한 기능을 구현함으로써 고객의 요구사항을 충실히 반영할 수 있었습니다.\n프로젝트 과정에서 고객과의 소통을 통해 요구사항을 정리하고 수시로 피드백을 반영하는 등\n실질적인 CS(고객 응대) 경험도 쌓을 수 있었습니다. 비록 직접적인 코드 구현은 없었지만,\n워드프레스의 테마 구조와 페이지 구성 방식, 기본적인 PHP 동작 원리에 대한 이해를 깊게 다질 수 있었고,\nCMS 기반 웹사이트 제작의 실무 흐름을 폭넓게 경험할 수 있었습니다.",
        date: "2024.08 ~ 2024.09",
        function: "메인 레이아웃, 메뉴 구성, 홈화면 동영상 삽입, 상품 리스트 hover 시 착용 이미지 전환",
        skill: "Cafe24, Javascript, HTML, CSS, JQuery",
        contribution: "40%",
        url: "https://muagaofficial.com/"
    },
    teum: {
        title: "teum",
        description: "외주로 진행한 워드프레스 기반 홈페이지 제작 프로젝트로, 고객이 제공한 사진과 텍스트 콘텐츠를 바탕으로\n각 섹션의 배치와 시각적 흐름을 고려하여 디자인 및 구조 작업을 진행했습니다.\n전체적인 레이아웃과 사용자 동선을 설계하면서 웹사이트의 시각적 완성도를 높이는 데 중점을 두었고,\n다양한 플러그인을 활용해 필요한 기능을 구현함으로써 고객의 요구사항을 충실히 반영할 수 있었습니다.\n프로젝트 과정에서 고객과의 소통을 통해 요구사항을 정리하고 수시로 피드백을 반영하는 등\n실질적인 CS(고객 응대) 경험도 쌓을 수 있었습니다. 비록 직접적인 코드 구현은 없었지만,\n워드프레스의 테마 구조와 페이지 구성 방식, 기본적인 PHP 동작 원리에 대한 이해를 깊게 다질 수 있었고,\nCMS 기반 웹사이트 제작의 실무 흐름을 폭넓게 경험할 수 있었습니다.",
        date: "2024.07 ~ 2024.08",
        function: "부드러운 스크롤, 웹사이트 구조 구성, 페이지 이동, 애니메이션, 탭 전환",
        skill: "Wordpress, Javascript, HTML, CSS, PHP",
        contribution: "100%",
        url: "https://teumacademy.com/"
        // 개선점도 해야되나 이미지 압축, 지연로드적용등?
    },
    mtsn: {
        title: "mtsn",
        description: "외주로 진행한 워드프레스 기반 홈페이지 제작 프로젝트로, 고객이 제공한 사진과 텍스트 콘텐츠를 바탕으로\n각 섹션의 배치와 시각적 흐름을 고려하여 디자인 및 구조 작업을 진행했습니다.\n전체적인 레이아웃과 사용자 동선을 설계하면서 웹사이트의 시각적 완성도를 높이는 데 중점을 두었고,\n다양한 플러그인을 활용해 필요한 기능을 구현함으로써 고객의 요구사항을 충실히 반영할 수 있었습니다.\n프로젝트 과정에서 고객과의 소통을 통해 요구사항을 정리하고 수시로 피드백을 반영하는 등\n실질적인 CS(고객 응대) 경험도 쌓을 수 있었습니다. 비록 직접적인 코드 구현은 없었지만,\n워드프레스의 테마 구조와 페이지 구성 방식, 기본적인 PHP 동작 원리에 대한 이해를 깊게 다질 수 있었고,\nCMS 기반 웹사이트 제작의 실무 흐름을 폭넓게 경험할 수 있었습니다",
        date: "2024.02 ~ 2024.03",
        function: "부드러운 스크롤, 웹사이트 구조 구성, 페이지 이동, 애니메이션",
        skill: "Wordpress, Javascript, HTML, CSS, PHP",
        contribution: "100%",
        url: "https://mtsncompany.com/"
    },
};